#ifndef SQUARESOLVER_H
#define SQUARESOLVER_H


#include <assert.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>


#define ASSERT(cond)\
    do {            \
	    if (!(cond))\
		    printf("\tError in line %d\n\tof the file %s\n\tcondinion (%s) is false\n", __LINE__, __FILE__, #cond);\
    } while(0)

int longest_sequence(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает подмассив-прогрессию и возвращает длину масимальной прогрессии

int plus_minus_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает итоговый массив и возвращает длину масимальной прогрессии

int bubble_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает отсортированный массив и возвращает длину масимальной прогрессии

int shake_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает отсортированный массив и возвращает длину масимальной прогрессии

int selection_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает отсортированный массив и возвращает длину масимальной прогрессии

int sqt_selection_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает отсортированный массив и возвращает длину масимальной прогрессии

int insert_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает отсортированный массив и возвращает длину масимальной прогрессии

int shell_sort(int len, int* list); // Функция принимает длину массива и указатель на его начальный элемент, распечатывает отсортированный массив и возвращает длину масимальной прогрессии

#endif